app/controllers/resources_controller.rb

  def create
    @resource = Resource.new(resource_params)

    respond_to do |format|
      if @resource.save
---
INSERT INTO "resources" ("name", "description", "user_id", "created_at", "updated_at", "link") VALUES (?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @resource.update(resource_params)
---
UPDATE "resources" SET "link" = ?, "updated_at" = ? WHERE "resources"."id" = ?  [["link", "https://rrserver.herga.net/RDWeb/Pages/en-US/login.aspx?ReturnUrl=/RDWeb/Pages/en-US/Default.aspx"], ["updated_at", "2018-10-07 22:09:09.383167"], ["id", 1]]